# BalusterPlacement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RailingType..::..BalusterPlacement Property
RailingType Class See Also
---
Accesses the object containing properties related to the baluster placement.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public BalusterPlacement BalusterPlacement { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BalusterPlacement As BalusterPlacement
	Get
```

Visual C++
---
```text
public:
property BalusterPlacement^ BalusterPlacement {
	BalusterPlacement^ get ();
}
```

# See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace